{"ህ": 4,"ል": 5, "ም": 6, "ር": 7, "ስ": 8, "ሽ": 9, "ቅ": 10, "ብ": 11, "ቭ": 12, "ት": 13, "ች": 14, "ን": 15, "ኝ": 16, "ክ": 17, "ው": 18, "ዝ": 19, "ዥ": 20, "ይ": 21, "ድ": 22, "ጅ": 23, "ግ": 24, "ጥ": 25, "ጭ": 26, "ጵ": 27, "ጽ": 28, "ፍ": 29, "ፕ": 30, "ኧ": 31, "አ": 32, "ኡ": 33, "ኢ": 34, "ኤ": 35, "እ": 36, "ኦ": 37, "ኸ": 38, "ሀ": 39, "ሁ": 40, "ሂ": 41, "ሄ": 42, "ሆ": 43, "ለ": 44, "ሉ": 45, "ሊ": 46, "ላ": 47, "ሌ": 48, "ሎ": 49, "መ": 50, "ሙ": 51, "ሚ": 52, "ማ": 53, "ሜ": 54, "ሞ": 55, "ረ": 56, "ሩ": 57, "ሪ": 58, "ራ": 59, "ሬ": 60, "ሮ": 61, "ሰ": 62, "ሱ": 63, "ሲ": 64, "ሳ": 65, "ሴ": 66, "ሶ": 67, "ሸ": 68, "ሹ": 69, "ሺ": 70, "ሻ": 71, "ሼ": 72, "ሾ": 73, "ቀ": 74, "ቁ": 75, "ቂ": 76, "ቃ": 77, "ቄ": 78, "ቆ": 79, "በ": 80, "ቡ": 81, "ቢ": 82, "ባ": 83, "ቤ": 84, "ቦ": 85, "ቨ": 86, "ቩ": 87, "ቪ": 88, "ቫ": 89, "ቬ": 90, "ቮ": 91, "ተ": 92, "ቱ": 93, "ቲ": 94, "ታ": 95, "ቴ": 96, "ቶ": 97, "ቸ": 98, "ቹ": 99, "ቺ": 100, "ቻ": 101, "ቼ": 102, "ቾ": 103, "ነ": 104, "ኑ": 105, "ኒ": 106, "ና": 107, "ኔ": 108, "ኖ": 109, "ኘ": 110, "ኙ": 111, "ኚ": 112, "ኛ": 113, "ኜ": 114, "ኞ": 115, "ከ": 116, "ኩ": 117, "ኪ": 118, "ካ": 119, "ኬ": 120, "ኮ": 121, "ወ": 122, "ዉ": 123, "ዊ": 124, "ዋ": 125, "ዌ": 126, "ዎ": 127, "ዘ": 128, "ዙ": 129, "ዚ": 130, "ዛ": 131, "ዜ": 132, "ዞ": 133, "ዠ": 134, "ዡ": 135, "ዢ": 136, "ዣ": 137, "ዤ": 138, "ዦ": 139, "የ": 140, "ዩ": 141, "ዪ": 142, "ያ": 143, "ዬ": 144, "ዮ": 145, "ደ": 146, "ዱ": 147, "ዲ": 148, "ዳ": 149, "ዴ": 150, "ዶ": 151, "ጀ": 152, "ጁ": 153, "ጂ": 154, "ጃ": 155, "ጄ": 156, "ጆ": 157, "ገ": 158, "ጉ": 159, "ጊ": 160, "ጋ": 161, "ጌ": 162, "ጐ": 163, "ጠ": 164, "ጡ": 165, "ጢ": 166, "ጣ": 167, "ጤ": 168, "ጦ": 169, "ጨ": 170, "ጩ": 171, "ጪ": 172, "ጫ": 173, "ጬ": 174, "ጮ": 175, "ጰ": 176, "ጱ": 177, "ጲ": 178, "ጳ": 179, "ጴ": 180, "ጶ": 181, "ጸ": 182, "ጹ": 183, "ጺ": 184, "ጻ": 185, "ጼ": 186, "ጾ": 187, "ፈ": 188, "ፉ": 189, "ፊ": 190, "ፋ": 191, "ፌ": 192, "ፎ": 193, "ፐ": 194, "ፑ": 195, "ፒ": 196, "ፓ": 197, "ፔ": 198, "ፖ": 199, "ኋ": 200, "ሏ": 201, "ሟ": 202, "ሯ": 203, "ሷ": 204, "ሿ": 205, "ቋ": 206, "ቧ": 207, "ቯ": 208, "ቷ": 209, "ቿ": 210, "ኗ": 211, "ኟ": 212, "ኳ": 213, "ዟ": 214, "ዧ": 215, "ዷ": 216, "ጇ": 217, "ጓ": 218, "ጧ": 219, "ጯ": 220, "ጷ": 221, "ጿ": 222, "ፏ": 223, "ፗ": 224, "ጔ": 225, "ኴ": 226, "ኌ": 227, "ቌ": 228, "ጒ": 229, "ኲ": 230, "ኊ": 231, "ቊ": 232}